Comment: |
  Downloads the latest Offline PrismaAccessBrowser from PaloAlto Networks
  From:
  https://docs.paloaltonetworks.com/prisma-access-browser/deployment/prisma-access-browser-update-mechanics
Identifier: com.github.jpiperberg.download.PrismaAccessBrowser-Win64
MinimumVersion: "2.3"
Input:
  NAME: PrismaAccessBrowser
  COMPANY: PaloAlto Networks
  APPCAST_URL: https://bfe078e7921507bb.talon-sec.com/sparkle/PAB/offline-win/appcast.xml
  SignerString: | # Processor uses re.compile, so copying and pasting the string that appears after "Subject" should work
    CN=Palo Alto Networks\, Inc,O=Palo Alto Networks\, Inc,L=Santa Clara,ST=California,C=US,serialNumber=3932466,businessCategory=Private Organization,jurisdictionST=Delaware,jurisdictionC=US
Process:
  - Processor: SparkleUpdateInfoProvider
    Arguments:
      appcast_url: "%APPCAST_URL%"
  - Processor: URLDownloader
  - Processor: EndOfCheckPhase
  - Processor: StopProcessingIf
    Arguments:
      predicate: version == "" OR version == "None"
  - Processor: com.github.jpiperberg.SharedProcessors/OsslsigncodeVerifier
    Arguments:
      pathname: "%pathname%"
      signer_string: '%SignerString%'
  - Processor: StopProcessingIf
    Arguments:
      predicate: verified == "False" OR verified == ""
 