Comment: |
  Downloads the latest Offline PrismaAccessBrowser from PaloAlto Networks
  From:
  https://docs.paloaltonetworks.com/prisma-access-browser/deployment/prisma-access-browser-update-mechanics
Identifier: com.github.jpiperberg.download.PrismaAccessBrowser-Win64
MinimumVersion: "2.3"
Input:
  NAME: PrismaAccessBrowser
  COMPANY: PaloAlto Networks
  APPCAST_URL: https://bfe078e7921507bb.talon-sec.com/sparkle/PAB/offline-win/appcast.xml
Process:
  - Processor: SparkleUpdateInfoProvider
    Arguments:
      appcast_url: "%APPCAST_URL%"
  - Processor: URLDownloader
  - Processor: EndOfCheckPhase
  - Processor: SignToolVerifier
    Arguments:
      input_path: "%pathname%"
  - Processor: StopProcessingIf
    Arguments:
      predicate: version == "" OR version == "None"