Comment: |
    Downloads Win MSI for CorettoJDK 17
    https://corretto.aws/downloads/latest/amazon-corretto-17-x64-windows-jdk.msiDescription: Downloads the latest version of the RapidMiner Studio exe.
Identifier: com.github.jpiperberg.download.CorettoJDK17-Win
MinimumVersion: '2.3'
Input:
    NAME: CorettoJDK17-Win
Process:
    - Processor: URLDownloader
      Arguments:
        url: 'https://corretto.aws/downloads/latest/amazon-corretto-17-x64-windows-jdk.msi'
    - Processor: EndOfCheckPhase
    - Processor: com.github.hansen-m.SharedProcessors/MSIInfoVersionProvider
      Arguments:
        msi_path: '%pathname%'