Comment: |
    Downloads Win MSI for Coretto JRE8 32bit
    https://corretto.aws/downloads/latest/amazon-corretto-8-x86-windows-jre.msi
Description: Downloads the latest version of the Amazon Coretto JRE 8 for Windows 32 bit
Identifier: com.github.jpiperberg.download.CorettoJRE8-32bit-Win
MinimumVersion: '2.3'
Input:
    NAME: CorettoJRE8-32Bit-Win
    
Process:
    - Processor: URLDownloader
      Arguments:
        url: 'https://corretto.aws/downloads/latest/amazon-corretto-8-x86-windows-jre.msi'
    - Processor: EndOfCheckPhase
    - Processor: com.github.hansen-m.SharedProcessors/MSIInfoVersionProvider
    Arguments:
        msi_path: '%pathname%'
