Comment: |
    Downloads Win MSI for CorettoJRE8
    https://corretto.aws/downloads/latest/amazon-corretto-8-x64-windows-jre.msi
Description: Downloads the latest version of the Amazon Coretto JRE 8 for Windows
Identifier: com.github.jpiperberg.download.CorettoJRE8-Win
MinimumVersion: '2.3'
Input:
    NAME: CorettoJRE8-Win
    
Process:
    - Processor: URLDownloader
      Arguments:
        url: 'https://releases.rapidminer.com/latest/rapidminer-studio/rapidminer-studio-win64-install.exe'
    - Processor: EndOfCheckPhase
    - Processor: com.github.hansen-m.SharedProcessors/MSIInfoVersionProvider
      Arguments:
        msi_path: '%pathname%'