Comment: |
    Downloads Win MSI for CorrettoJRE8
    https://corretto.aws/downloads/latest/amazon-corretto-8-x64-windows-jre.msi
Description: Downloads the latest version of the Amazon Coretto JRE 8 for Windows
Identifier: com.github.jpiperberg.download.CorrettoJRE8-Win
MinimumVersion: '2.3'
Input:
    NAME: CorrettoJRE8-Win
    
Process:
    - Processor: URLDownloader
      Arguments:
        url: 'https://corretto.aws/downloads/latest/amazon-corretto-8-x64-windows-jre.msi'
        prefetch_filename: True
    - Processor: EndOfCheckPhase
    - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
    - Processor: com.github.jgstew.SharedProcessors/TextSearcher
      Arguments:
        input_string: '%pathname%'
        re_pattern: '%versionRegEx'
        result_output_var_name: version