Description: Downloads the latest version of Splashtop Streamer.
Identifier: com.github.jpiperberg.download.SplashtopStreamer
Input: 
  NAME: SplashtopStreamer
MinimumVersion: 2.3.0
Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.dmg'
    url: 'https://my.splashtop.com/csrs/mac'
- Processor: EndOfCheckPhase
- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
      - 'Developer ID Installer: Splashtop Inc. (CPQQ3AW49Y)'
      - 'Developer ID Certification Authority'
      - 'Apple Root CA'
    input_path: '%pathname%/Splashtop Streamer.pkg'
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
    flat_pkg_path: '%pathname%/Splashtop Streamer.pkg'
    purge_destination: 'true'
- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/Applications'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/Splashtop_Streamer-installer.pkg/Payload'
    purge_destination: 'true'
- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/Applications/Splashtop Streamer.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
