<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download the latest version of the Oracle VirtualBox installer.</string>
	<key>Identifier</key>
	<string>com.github.jpiperberg.download.VirtualBox-Win</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VirtualBox</string>
		
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>curl_opts</key>
				<array>
					<string>--remote-header-name</string>
				</array>
				<key>url</key>
				<string>https://download.virtualbox.org/virtualbox/LATEST-STABLE.TXT</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
        	<key>Processor</key>
        	<string>com.github.jgstew.SharedProcessors/SharedUtilityMethods</string>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>com.github.jgstew.SharedProcessors/FileTextSearcher</string>
            <key>Arguments</key>
            <dict>
            	<key>search_path</key>
                <string>%pathname%</string>
                <key>first_result_only</key>
                <true/>
                <key>search_pattern</key>
                <string>\d*\.\d*\.\d*</string>
                <key>file_search_results_var</key>
                <string>version</string>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>PathDeleter</string>
        	<key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%pathname%</string>
                </array>
            </dict>
        </dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>curl_opts</key>
				<array>
					<string>--remote-header-name</string>
				</array>
				<key>filename</key>
				<string>installerList.txt</string>
				<key>url</key>
				<string>https://download.virtualbox.org/virtualbox/%version%/</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
        <dict>
        	<key>Processor</key>
        	<string>com.github.jgstew.SharedProcessors/FileTextSearcher</string>
            <key>Arguments</key>
            <dict>
            	<key>search_path</key>
                <string>%pathname%</string>
                <key>first_result_only</key>
                <true/>
                <key>search_pattern</key>
                <string><![CDATA[(?<=\").+?(?=Win\.exe\")]]></string>
                <key>file_search_results_var</key>
                <string>installerName</string>
            </dict>
        </dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>VirtualBox-%version%-Win.exe</string>
				<key>url</key>
				<string>https://download.virtualbox.org/virtualbox/%version%/%installerName%Win.exe</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
