Description: |
  Downloads the latest version of Node.js
Identifier: com.github.jpiperberg.download.Node.js
Input:
  NAME: Node.js
  base_url: 'https://nodejs.org'
  # Added for flexibility
  # platform can be nothing (macOS universal), win, linux, darwin, aix
  # extension can be .pkg, (.msi, .zip, .7z,)Windows .tar.gz or .tar.xz (win, darwin, aix and linux)
  # ARCH can be nothing (macOS universal) x64, arm64, (armv7l, s390x, ppc64le)linux
  platform: ''
  extension: '.pkg'
  ARCH: ''
MinimumVersion: 2.3.0
Process:
- Processor: URLTextSearcher
  Arguments:
    url: '%base_url%/dist/latest'
    re_pattern: '(?P<download_url>(?<=\").*node-v(?P<version>[\d\.]+)\.pkg(?=\"))'
- Processor: URLDownloader
  Arguments:
    url: '%base_url%%download_url%'
# - Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
# # Get Node.js Version
# - Processor: com.github.jgstew.SharedProcessors/TextSearcher
#   Arguments:
#     input_string: '%download_url%'
#     search_pattern: '(?<=-v)[\d\.]+(?=\.pkg)'
#     result_output_var_name: version
- Processor: EndOfCheckPhase
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%'
    expected_authority_names:
      - 'Developer ID Installer: Node.js Foundation (HX7739G8FX)'
      - 'Developer ID Certification Authority'
      - 'Apple Root CA'
