<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download the latest version of the RapidMiner Studio installer.</string>
	<key>Identifier</key>
	<string>com.github.jpiperberg.download.RapidMinerStudio-Win-XML</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>RapidMinerStudio</string>
		<key>versionRegEx</key>
		<string><![CDATA[(?<=studio-)(?P<version>.+?)(?=-win64)]]></string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://releases.rapidminer.com/latest/rapidminer-studio/rapidminer-studio-win64-install.exe</string>
				<key>prefetch_filename</key>
				<string>True</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.jgstew.SharedProcessors/SharedUtilityMethods</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.jgstew.SharedProcessors/TextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>input_string</key>
				<string>%pathname%</string>
				<key>re_pattern</key>
				<string>%versionRegEx%</string>
			</dict>
		</dict>

<!-- This doesn't seem to work for some reason, even though windows explorer
	sees the version.  Getting it out of the pathname.
        <dict>
            <key>Processor</key>
            <string>com.github.hansen-m.SharedProcessors/ExeVersionExtractor</string>
            <key>Arguments</key>
            <dict>
                <key>exe_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
 -->
	</array>
</dict>
</plist>
