<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download the latest version of the RapidMiner Studio installer.</string>
	<key>Identifier</key>
	<string>com.github.jpiperberg.download.RapidMinerStudio-Win-XML</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>RapidMinerStudio</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>curl_opts</key>
				<array>
					<string>--remote-header-name</string>
				</array>
				<key>url</key>
				<string>https://releases.rapidminer.com/latest/rapidminer-studio/rapidminer-studio-win64-install.exe</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
        <!-->
        <dict>
            <key>Processor</key>
            <string>com.github.hansen-m.SharedProcessors/ExeVersionExtractor</string>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <-->
	</array>
</dict>
</plist>
