Comment: |
    Downloads Win EXE for RapidMinerStudio
    https://pages.rapidminer.com/latest-studio-win64bit-download.html
Description: Downloads the latest version of the RapidMiner Studio exe.
Identifier: com.github.jpiperberg.download.RapidMinerStudio-Win
MinimumVersion: '2.3'
Input:
    NAME: RapidMinerStudio
    
Process:
    - Processor: URLDownloader
      Arguments:
        curl_opts: '--remote-header-name'
        url: 'https://releases.rapidminer.com/latest/rapidminer-studio/rapidminer-studio-win64-install.exe'
    - Processor: EndOfCheckPhase
    - Processor: com.github.hansen-m.SharedProcessors/ExeVersionExtractor
      Arguments: 
        file_path: '%pathname%'
