Comment: |
    Downloads Win EXE for RapidMinerStudio
    https://pages.rapidminer.com/latest-studio-win64bit-download.html
Description: Downloads the latest version of the RapidMiner Studio exe.
Identifier: com.github.jpiperberg.download.RapidMinerStudio-Win
MinimumVersion: '2.3'
Input:
    NAME: RapidMinerStudio
    versionRegEx: "(?<=studio-)(?P<version>.+?)(?=-win64)"
Process:
- Processor: URLDownloader
  Arguments:
    prefetch_filename: True
    url: 'https://releases.rapidminer.com/latest/rapidminer-studio/rapidminer-studio-win64-install.exe'
- Processor: EndOfCheckPhase
- Processor: com.github.jgstew.SharedProcessors/SharedUtilityMethods
- Processor: com.github.jgstew.SharedProcessors/TextSearcher
  Arguments:
    input_string: "%pathname%"
    re_pattern: "%versionRegEx%"
#     - Processor: com.github.hansen-m.SharedProcessors/ExeVersionExtractor
