<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Apache NetBeans.</string>
    <key>Identifier</key>
    <string>com.github.jpiperberg.download.ApacheNetBeans-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ApacheNetBeans</string>
        <key>BASE_URL</key>
        <string>https://netbeans.apache.org</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%BASE_URL%/download/archive/index.html</string>
                <key>re_pattern</key>
                <string><![CDATA[(?<=button success\".href=\").*(?=\")]]></string>
                <key>result_output_var_name</key>
                <string>match</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%BASE_URL%%match%</string>
                <key>re_pattern</key>
                <string><![CDATA[(?<=\").*\.exe(?=\")]]></string>
                <key>result_output_var_name</key>
                <string>intermediateURL</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%BASE_URL%%match%</string>
                <key>re_pattern</key>
                <string><![CDATA[(?<=64.exe<\/a> \(<a href=\").*\.sha512(?=\")]]></string>
                <key>result_output_var_name</key>
                <string>shaURL</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%intermediateURL%</string>
                <key>re_pattern</key>
                <string><![CDATA[https:\/\/dlcdn\.apache\.org\/netbeans\/netbeans-installers.*(?=\")]]></string>
                <key>result_output_var_name</key>
                <string>downloadURL</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%BASE_URL%%match%</string>
                <key>re_pattern</key>
                <string><![CDATA[ (?<=Downloading Apache NetBeans ).*(?=<)]]></string>
                <key>result_output_var_name</key>
                <string>majorVersion</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
            	<key>url</key>
            	<string>%downloadURL%</string>
                <key>filename</key>
                <string>%NAME%.exe</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
            	<key>url</key>
            	<string>%shaURL%</string>
                <key>filename</key>
                <string>%NAME%.sha512</string>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>BESRelevanceProvider</string>
        	<key>Arguments</key>
        	<dict>
                <key>bes_relevance</key>
                <string><![CDATA[preceding texts of firsts " " of lines of file "%RECIPE_CACHE_DIR%/downloads/%NAME%.sha512"]]></string>
                <key>output_var_name</key>
                <string>SHA512</string>
        	</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
		<dict>   
			<key>Processor</key>   
			<string>io.github.hjuutilainen.SharedProcessors/ChecksumVerifier</string>   
			<key>Arguments</key>   
			<dict>   
				<key>pathname</key>   
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.exe</string>
				<key>checksum</key>
				<string>%SHA512%</string>
				<key>algorithm</key>
				<string>SHA512</string>
			</dict>
		</dict>
		<dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.hansen-m.SharedProcessors/WinInstallerExtractor</string>
            <key>Arguments</key>
            <dict>
                <key>exe_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.exe</string>
                <key>extract_dir</key>
                <string>ExeExtract</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.hansen-m.SharedProcessors/BESRelevanceProvider</string>
            <key>Arguments</key>
            <dict>
                <key>bes_filepath</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.exe</string>
                <key>output_var_name</key>
                <string>version</string>
                <key>bes_relevance</key>
                <string>preceding texts of firsts "%22" of following texts of firsts " version=%22" of following texts of firsts "offset=%221000" of lines of file "registry.xml" of folder "%RECIPE_CACHE_DIR%/ExeExtract/data"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>version == "" OR version == "None"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>