Comment: |
  Downloads the latest Lansweeper installer
Identifier: com.github.jpiperberg.download.Lansweeper
MinimumVersion: "2.3"
Input:
  NAME: Lansweeper
  COMPANY: Lansweeper
  DOWNLOAD_URL: 'https://content.lansweeper.com/lsagent-mac/'
Process:
  - Processor: URLDownloader
    Arguments:
      url: '%DOWNLOAD_URL%'
      prefetch_filename: True
  - Processor: EndOfCheckPhase
  - Processor: Versioner
    Arguments:
      input_plist_path: '%pathname%/LsAgent-osx.app/Contents/Info.plist'
  - Processor: StopProcessingIf
    Arguments:
      predicate: download_changed == FALSE
  - Processor: StopProcessingIf
    Arguments:
      predicate: version == "" OR version == "None"
  
